def merge(left, right):
    merged = []
    left_index = 0
    right_index = 0

    # Спочатку об'єднайте менші елементи
    while left_index < len(left) and right_index < len(right):
        if left[left_index] <= right[right_index]:
            merged.append(left[left_index])
            left_index += 1
        else:
            merged.append(right[right_index])
            right_index += 1

    # Якщо в лівій або правій половині залишилися елементи,
    # додайте їх до результату
    while left_index < len(left):
        merged.append(left[left_index])
        left_index += 1

    while right_index < len(right):
        merged.append(right[right_index])
        right_index += 1

    return merged


def merge_k_lists(ls):
    if len(ls) > 1:
        ls.append(merge(ls.pop(), ls.pop()))
        return merge_k_lists(ls)
    return ls[0]


list_of_lists = [
    [27, 32, 34, 40, 42, 50, 52, 53, 56, 63, 63, 74],
    [6, 12, 27, 31, 31, 37, 41, 47, 56, 58, 59, 70, 80],
    [8, 10, 13, 16, 22, 27, 30, 35, 36, 38, 51, 60, 70],
    [3, 4, 14, 16, 26, 26, 29, 29, 34, 39, 53, 55, 69],
    [5, 5, 10, 16, 17, 25, 34, 38, 39, 43, 52, 55, 63, 69],
    [1, 11, 13, 13, 17, 21, 28, 32, 33, 35, 37, 44, 45, 50, 55],
    [7, 13, 23, 27, 36, 41, 44, 45, 45, 51, 52, 54, 67],
    [5, 5, 7, 8, 19, 24, 25, 28, 38, 39, 46, 53, 64],
    [3, 6, 8, 13, 14, 18, 21, 22, 24, 34, 45, 48, 63, 72],
    [1, 6, 11, 11, 21, 29, 31, 32, 38, 40, 43, 45, 45, 64, 74],
    [9, 13, 19, 20, 24, 28, 28, 32, 35, 38, 43, 45, 50, 52],
    [4, 7, 9, 12, 17, 19, 20, 21, 23, 29, 30, 33, 45, 49, 54],
    [11, 16, 20, 20, 23, 24, 26, 27, 32, 35, 37, 38, 39, 41, 56],
    [3, 3, 6, 6, 9, 16, 24, 24, 30, 32, 35, 36, 42, 56, 83],
    [2, 2, 7, 11, 11, 19, 24, 26, 30, 36, 42, 43, 47, 56, 60],
    [2, 3, 9, 15, 19, 20, 23, 27, 29, 37, 39, 41, 42, 48, 64],
    [6, 11, 14, 16, 22, 23, 28, 32, 32, 37, 43, 44, 46, 50, 59],
    [4, 8, 13, 15, 22, 29, 32, 33, 38, 42, 43, 44, 45, 46, 56],
    [8, 11, 11, 18, 21, 27, 28, 34, 36, 37, 43, 44, 47, 50, 87],
    [8, 8, 10, 14, 19, 21, 27, 34, 38, 42, 42, 43, 48, 52, 66],
]
merged_list = merge_k_lists(list_of_lists)
print("Відсортований список:", merged_list)
